app/mailers/user_mailer.rb

  def welcome_email(user)
    @user = user
    @url = 'http://example.com/login'
    if !@user.welcome_mail?
      mail(to: @user.email, subject: 'welcome to ROCKY shop')
      @user.update(welcome_mail: true)
---
UPDATE "users" SET "updated_at" = ?, "welcome_mail" = ? WHERE "users"."id" = ?  [["updated_at", "2022-10-10 10:31:21.786978"], ["welcome_mail", 1], ["id", 30]]