app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "username", "created_at", "updated_at", "welcome_mail") VALUES (?, ?, ?, ?, ?, ?)  [["name", "hamza6"], ["email", "usman.ahmed@invozone.com"], ["username", "hamza1"], ["created_at", "2022-10-10 10:19:59.486325"], ["updated_at", "2022-10-10 10:19:59.486325"], ["welcome_mail", nil]]